import pandas as pd

data = [
    ["삼성", '1000', '2000'],
    ["현대", '1100', '3000'],
    ["엘지", '2000', '500'],
    ["아모레", '3500', '6000'],
    ["네이버", '100', '1500'],
]

idx = ['031', '059', '033', '045', '023' ]
col = ['종목명', '시가', '종가']

df = pd.DataFrame(data=data, index=idx, columns=col)

print(df)
print("============== 시가가 1100원 이상인 행을 뽑아 ==================")
df['시가'] = df['시가'].astype(int)
print(df[df['시가'] >= 1100 ])

print("============== 시가가 1100원 이상인 종가만 뽑아 ==================")
print(df[df['시가'] >= 1100 ]['종가'])
print(df[df['시가'] >= 1100 ].iloc[:,2])